In [118]:
import numpy as np
import pandas as pd
import time

In [119]:
data = np.random.randint(low=1, high=10, size=(4, 5))
data

array([[1, 9, 6, 4, 6],
       [6, 1, 6, 6, 9],
       [9, 7, 8, 7, 9],
       [8, 6, 3, 3, 3]])

In [120]:
df = pd.DataFrame(data, columns=['c1', 'c2', 'c3', 'c4', 'c5'])
df['cat'] = ['car', 'car', 'bike', 'bike']
df.index.name = 'n'

In [121]:
df

   c1  c2  c3  c4  c5   cat
n
0   1   9   6   4   6   car
1   6   1   6   6   9   car
2   9   7   8   7   9  bike
3   8   6   3   3   3  bike

In [79]:
df.set_index(['cat'], append=True, inplace=True)

In [117]:
df

        c1  c2  c3  c4  c5
n cat
0 car    1   3   2   8   3
1 car    5   2   3   5   4
2 bike   5   2   2   3   1

In [116]:
df.drop(df.tail(1).index, inplace=True)

In [113]:
start = time.perf_counter()
new_index = df.index.get_level_values('n') // 2
end = time.perf_counter()
start - end

In [111]:
start = time.perf_counter()
new_index_np = np.floor_divide(df.index.get_level_values('n'), 2)
end = time.perf_counter()
start - end

In [81]:
group = df.groupby(level=1)

In [83]:
for f in group:
    a, b = f
    print(len(f))
    print(type(f))
    print(type(a))
    print(type(b))
    print(b)

2
<class 'tuple'>
<class 'str'>
<class 'pandas.core.frame.DataFrame'>
        c1  c2  c3  c4  c5
n cat
2 bike   5   2   2   3   1
3 bike   2   8   7   9   8
2
<class 'tuple'>
<class 'str'>
<class 'pandas.core.frame.DataFrame'>
       c1  c2  c3  c4  c5
n cat
0 car   1   3   2   8   3
1 car   5   2   3   5   4

In [84]:
def get_mean(group):
    print(len(group))
    mean = group.mean()
    return mean

In [85]:
means = group.apply(get_mean)

2
2

In [86]:
means

       c1   c2   c3   c4   c5
cat
bike  3.5  5.0  4.5  6.0  4.5
car   3.0  2.5  2.5  6.5  3.5

In [32]:
d, r = np.divmod(5, 3)

In [33]:
d

1

In [34]:
r

2

In [90]:
df.shape[0]

4

In [95]:
remainders = group.apply(lambda df: np.divmod(df.shape[0], 3))

In [99]:
type(remainders.iloc[0])

tuple

In [98]:
remainders

cat
bike    (0, 2)
car     (0, 2)
dtype: object